app/controllers/indices_controller.rb

        charge = event.data.object
    when 'charge.succeeded'
        charge = event.data.object
        Customer.find_by(email: event.data.object["billing_details"]["email"])
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = $1 LIMIT $2  [["email", "josh@mybond.com.au"], ["LIMIT", 1]]

  def create_customer
    @customer = Customer.new(first_name: params[:First_Name], email: params[:Email_Address], linked_in_profile: params[:linked_in_profile], image: params[:images])
    @customer.save
---
INSERT INTO "customers" ("first_name", "email", "linked_in_profile", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", ""], ["email", ""], ["linked_in_profile", ""], ["created_at", "2022-02-16 04:23:38.718216"], ["updated_at", "2022-02-16 04:23:38.718216"], ["image", "unnamed.jpeg"]]