app/controllers/nfts_controller.rb

SELECT "nfts".* FROM "nfts"
---
  def index
    @nfts = Nft.all

SELECT "nfts".* FROM "nfts" WHERE "nfts"."nft_id" = $1 LIMIT $2  [["nft_id", "1"], ["LIMIT", 1]]
---
  def show
    @nft = Nft.find_by(nft_id: params[:id])

INSERT INTO "nfts" ("id", "token_link", "owner_name", "wallet_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["id", 0], ["token_link", "[FILTERED]"], ["owner_name", "sdsf"], ["wallet_address", "weffds"], ["created_at", "2022-02-17 22:52:45.998154"], ["updated_at", "2022-02-17 22:52:45.998154"]]
---
  def create
    @nft = Nft.new(nft_params)
    @nft[:nft_id] = produce_token
    respond_to do |format|
      if @nft.save

SELECT "nfts".* FROM "nfts" WHERE "nfts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_nft
      @nft = Nft.find(params[:id])